In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('SalesDataset.csv')

df = pd.DataFrame(data)

In [3]:
df.head()

,Unnamed: 0,Date,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount
0,0,24-11-2023,Male,34,Beauty,3,50,150
1,1,27-02-2023,Female,26,Clothing,2,500,1000
2,2,13-01-2023,Male,50,Electronics,1,30,30
3,3,21-05-2023,Male,37,Clothing,1,500,500
4,4,06-05-2023,Male,30,Beauty,2,50,100

In [4]:
df.describe()

        Unnamed: 0          Age     Quantity  Price per Unit  Total Amount
count  1007.000000  1007.000000  1007.000000     1007.000000   1007.000000
mean    503.000000    41.443893     3.064548      179.235353    520.456802
std     290.840162    13.713070    10.497032      189.231104   1198.266782
min       0.000000    18.000000     1.000000       25.000000     25.000000
25%     251.500000    30.000000     1.000000       30.000000     60.000000
50%     503.000000    42.000000     3.000000       50.000000    150.000000
75%     754.500000    53.000000     4.000000      300.000000    900.000000
max    1006.000000    78.000000   300.000000      500.000000  30000.000000

For the give data set using IQR technique  

a) find out the outliers and write it to CSV 

b) write the cleaned data to CSV by excluding the outliers

In [5]:
p025 = df['Total Amount'].quantile(0.25)
p075 = df['Total Amount'].quantile(0.75)
print('0.25 = ',p025)
print('0.75 = ',p075)

0.25 =  60.0
0.75 =  900.0

In [6]:
IQR = p075 - p025
print(IQR)

840.0

In [7]:
lower_bound = p025 - 1.5 * IQR
upper_bound = p075 + 1.5 * IQR

In [8]:
outliers = df[(df['Total Amount'] < lower_bound) | (df['Total Amount'] > upper_bound)]
print("\nOutliers detected:")
print(outliers)

Outliers detected:
      Unnamed: 0        Date  Gender  Age Product Category  Quantity  \
446          446  06-07-2023    Male   22           Beauty         4
1000        1000  12-04-2023    Male   47         Clothing        10
1001        1001  12-04-2023    Male   35         Clothing        10
1002        1002  12-04-2023  Female   46           Beauty       300
1003        1003  12-04-2023  Female   78           Beauty       100
1005        1005  12-04-2023    Male   35      Electronics       100
1006        1006  12-04-2023    Male   67         Clothing        50

      Price per Unit  Total Amount
446              500          5000
1000              50          5000
1001              50          5000
1002             100         30000
1003             100         10000
1005              50          5000
1006             200         10000

In [9]:
outliers.to_csv('Outliers.csv', index=False)

In [10]:
df_cleaned = df.drop(outliers.index)

In [11]:
df_cleaned.to_csv('cleaned_data.csv', index=False)